#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.saml-app.okta_app_saml.saml_app["deserthomescleaning"] will be created
  + resource "okta_app_saml" "saml_app" {
      + accessibility_self_service = false
      + app_links_json             = jsonencode(
            {
              + slack_ink = true
            }
        )
      + app_settings_json          = jsonencode(
            {
              + domain = "deserthomescleaning"
            }
        )
      + auto_submit_toolbar        = false
      + certificate                = (known after apply)
      + entity_key                 = (known after apply)
      + entity_url                 = (known after apply)
      + hide_ios                   = false
      + hide_web                   = false
      + honor_force_authn          = false
      + http_post_binding          = (known after apply)
      + http_redirect_binding      = (known after apply)
      + id                         = (known after apply)
      + key_id                     = (known after apply)
      + label                      = "Slack deserthomescleaning"
      + logo_url                   = (known after apply)
      + metadata                   = (known after apply)
      + metadata_url               = (known after apply)
      + name                       = (known after apply)
      + preconfigured_app          = "slack"
      + saml_version               = "2.0"
      + sign_on_mode               = (known after apply)
      + skip_groups                = false
      + skip_users                 = false
      + status                     = "ACTIVE"
      + user_name_template         = "${source.login}"
      + user_name_template_type    = "BUILT_IN"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "google_impersonated_user_email" but a value was found in file
│ "/github/workspace/staging/accounts/slack-app/../../../common.tfvars". If
│ you meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "google_customer_id" but
│ a value was found in file
│ "/github/workspace/staging/accounts/slack-app/../../../common.tfvars". If
│ you meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 15 other variable(s)
│ defined without being declared.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
time=2022-01-12T04:50:36Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt Slack App`, Action: `__the-commons-project_terragrunt-github-actions_4`, Working Directory: `./staging/accounts/slack-app/`, Workspace: `default`*
